{
    "_apidate": "2011080100", 
    "_id": {
        "$oid": "527a7c322bbf2fb069000008"
    }, 
    "app_id": "2daa223cdf3eb171291d929d", 
    "asset_type": "sitesense", 
    "avatar": false, 
    "date": {
        "$date": 1383758898022
    }, 
    "description": "", 
    "from_backup": null, 
    "media_hash": "098d234d377ba497ea26b62bad58f5196408", 
    "mime_type": "application/-gimmebar-sitesense", 
    "name": "With Great Joy – Rands in Repose", 
    "owner": "4e7cc08b2e0aaabe19000002", 
    "private": false, 
    "sitesense": {
        "article_body": "Rands A little bit of sadness\nWith Great Joy\nIt is with great joy and a little bit of sadness that I welcome you to next version of Rands.\nFor a long list of dear friends, I’m “that guy”. I’m the guy who has told an endless number of people that the redesign of Rands has been just around the corner for the last six years and it’s never happened. There have been no less than three designers who have contributed work to designs that simply never happened, and I apologize to each and every one of you. But each design contributed to what you see now – a completely new version of the site.\nThis final iteration is entirely the fault of my good friend Alex King . Several years ago, Alex was one of the unlucky participants in a “Hey, can you help with me with a redesign?” false start, and to his credit he still speaks to me. This July, he contacted me and wrote:\n“You mind if I put together a wireframe or two for your consideration?  Scratch that – I’m excited about the ideas so I will be putting together the rough wireframes – and I’ll send them to you.”\nAlex’s initial concepts were a marriage of the design elements I loved from the old site – typography, color palette – with a goal for the new site: a focus on the words. While I love the old site like an old beat-up leather jacket that I’ll never throw away, it was accreting cruft. As I look at each piece of cruft, I remember my decision to put it there, but when I look at the whole, I’ve been slowly losing focus on the words.\nEverything is Different\nHere’s what’s changed:\nI believe the new site is incredibly readable on a big screen, tablet, or phone. If you don’t believe me, resize this window and see how responsive design provides a pleasant reading experience regardless of window size.\nAfter a good long run on Movable Type, the site is now run on the latest version of WordPress. My site is not fancy and has happily served up static pages for years. This static page strategy made the site resilient to a variety of traffic conditions. While I’m assured that WordPress’s scalability issues are long gone, I won’t actually believe it until the new site handles the load.\nI’m often asked why I chose to put post dates for article at the bottom of the pieces. The people who ask are in a hurry and mostly care only whether the content is new rather than good. There are over 400 articles of greatly varying quality and some are fortunate enough to stand the test of time. For this redesign, a significant amount of work was done to make it easier to stumble upon this content. In addition to spending time categorizing existing articles, I’ve also combined and added new categories to make it easier to find articles. My favorite new category is Tools , which documents my obsession with pens, paper, coffee mugs, and, soon, conference badges.\nFrequent readers have noted that I’ve gone from three or four articles a month to maybe one or two. I’ve developed irrational emotional baggage about what constitutes a Rands article and I want to write more. While I believe long form articles are the bread and butter of this site, I’ve created a new Excerpt type that enables me to post much smaller pieces without the word count and editing requirements of the long form pieces. As I don’t know how I’ll use Excerpts, there is a finite chance you may hate these smaller posts, which is why we’ve developed two different feeds for the site:\nEverything is what you see on the Blog page and contains, well, everything.\nLong form is just the long form pieces – you’ll always see the latest long piece on the front page of the site.\nIf RSS isn’t your thing, there is a mailing list where I’ll continue the practice of announcing long form pieces and occasionally asking for help on site redesigns. @rands will still announce long form articles, but @rands_briefly will announce all new content.\nLastly, there’s the Sandbox. The Sandbox has been a part of each redesign I’ve never finished and I’m very happy to finally land this simple concept. In addition to providing jumps to various useful content on the site, it also documents what I consider to be additional Rands canon: the Twitter and Instagram accounts. A Sandbox is where you play, I play on Twitter and Instagram, and you should come play, too.\nA Little Bit of Sadness\nThis is the fifth revision to the site, but this is the first time someone else has done a majority of the heavy lifting. It’s been a point of pride for me that I’ve been responsible for every single part of the site save for the hosting , but it’s precisely this pride which has prevented the site from evolving.\nAlex and his team at Crowd Favorite borrowed elements from the existing design, but re-implemented the WordPress design from scratch utilizing their responsive CSS grid and Carrington Core templating framework. What they’ve crafted is a site where all of the content is deftly managed inside of the WordPress application. Work that was a pain in Movable Type is an afterthought in WordPress. Additionally, the site infrastructure is deliciously stored in git, which, I’m embarrassed to say, is my first opportunity to really use git. Don’t judge.\nWhen Alex mailed me with his ideas for wireframes in July, I had no credible plan to launch a new version of Rands, let alone a modern, mobile-friendly site that not only provides creative options for the future, but also excavates over ten years of content buried in the archives . Sure, I’d been asking for help from designers and developers, but I wasn’t getting enough help because I wasn’t delegating enough.\nIf delegating doesn’t hurt, you’re getting less done than you could.\nWelcome to new site. I’d love to hear what you think. I’m certain things are broken and I’d appreciate your patience while I fix them. Lastly, thanks for a being a reader. I’ve got more to say, and thanks to Alex and Crowd Favorite, I have a modern platform where I can say it and this brings me great joy.\n#\n", 
        "minURL": "randsinrepose.com/archives/with-great-joy/", 
        "type": "article", 
        "url": "http://randsinrepose.com/archives/with-great-joy/"
    }, 
    "source": "http://randsinrepose.com/archives/with-great-joy/", 
    "tags": [], 
    "url_token": "aT3Fn"
}